/*————————————————————————————————————————————————————————————————————————————————————————
 * @Author: jason minmin0777@126.com
 * @Date: 2024-07-08 17:28:56
 * @LastEditors: jason minmin0777@126.com
 * @LastEditTime: 2024-07-08 17:29:43
 * @FilePath: \Crystal.Live.2\src\library\common\include\CommonStructDefine.h
 * @Description:
 * @
 * @#|----------------------------------------------------------------------------|
 * @#|  Remark         : Description                                              |
 * @#|----------------------------------------------------------------------------|
 * @#|  Change History :                                                          |
 * @#|  <Date>     | <Version> | <Author>       | <Description>                   |
 * @#|----------------------------------------------------------------------------|
 * @#|  2024/05/02 | 0.0.0.1   | jason.chen     | Create file                     |
 * @#|----------------------------------------------------------------------------|
 * @#|                                                                            |
 * @#|----------------------------------------------------------------------------|
 * @Copyright (c) 2024 by ${git_name_email}, All Rights Reserved.
 ————————————————————————————————————————————————————————————————————————————————————————*/
#pragma once

 /** --------------------------------------------------------------------------------------------------------------------------
  * @class    Thread_Status
  * @brief    线程状态
  * @version  0.0.1
  * @date     2024-07-08
  * @remark   线程的状态标志，建议使用std::atomic<Thread_Status>进行包装，以保证线程安全
  --------------------------------------------------------------------------------------------------------------------------*/

enum class Thread_Status
{
  Thread_Status_Unknown = 0,  //未知
  Thread_Status_Running = 1,  //运行
  Thread_Status_Stop = 2,     //停止  
  Thread_Status_Pause = 3,    //暂停
  Thread_Status_Exit = 4,     //退出
};